# Main
brew 'atuin'
brew 'micro'

# Kubernetes
brew 'kubernetes-cli'
brew 'kustomize'
brew 'k9s'
brew 'popeye'
brew 'kubeseal'
brew 'argocd'
brew 'helm'
brew 'k0sproject/tap/k0sctl'
brew 'int128/kubelogin/kubelogin'
brew 'cmctl' # cert-manager
brew 'kubectl-cnpg'
brew 'kubectl-rook-ceph'
brew 'robusta-dev/homebrew-krr/krr'

# DevOps Tools
brew 'dive'
brew 'trivy'
brew 'hashicorp/tap/terraform'

# ZSH
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'
